[
  {
    "board": "general",
    "title": "Welcome to the new forum!",
    "posts": [
      {
        "author": "admin",
        "content": "Hey everyone! Welcome to our new bulletin board. Feel free to introduce yourselves and start some discussions. Please keep things civil and on-topic."
      },
      {
        "author": "tech_enthusiast!abc123",
        "content": "First! This looks great, much cleaner than the old phpBB setup. Love the minimal design."
      },
      {
        "author": "lurker42",
        "content": "Finally decided to make an account after lurking for months. The tripcode system is interesting - no registration needed but still some identity verification."
      },
      {
        "author": "old_timer",
        "content": "Reminds me of the early 2000s forums. Simple, fast, gets the job done. Hope we can build a good community here."
      }
    ]
  },
  {
    "board": "general",
    "title": "Best programming languages in 2024?",
    "posts": [
      {
        "author": "coder_pete!xyz789",
        "content": "What do you all think are the most important programming languages to learn right now? I'm seeing a lot of demand for Rust and Go in backend development."
      },
      {
        "author": "js_ninja",
        "content": "JavaScript/TypeScript is still king for web development. React, Node.js, the whole ecosystem is massive. Can't go wrong there."
      },
      {
        "author": "pythonista!def456",
        "content": "Python remains incredibly versatile - web dev with Django/FastAPI, data science, AI/ML, automation. Great first language too."
      },
      {
        "author": "systems_guy",
        "content": "Rust is amazing for systems programming. Memory safety without garbage collection. Learning curve is steep but worth it."
      },
      {
        "author": "full_stack_dev",
        "content": "Honestly depends on what you want to build. Mobile? Swift/Kotlin. Games? C#/C++. Web? JS/Python/Go. Pick your poison."
      },
      {
        "author": "coder_pete!xyz789",
        "content": "Good points all around. I think I'll focus on Go for backend and TypeScript for frontend. Seems like a solid combo."
      }
    ]
  },
  {
    "board": "general",
    "title": "Self-hosting discussion",
    "posts": [
      {
        "author": "homelab_hero!server123",
        "content": "Anyone else running their own servers at home? Just set up a Proxmox cluster with some old hardware. Running NextCloud, Plex, and a few other services."
      },
      {
        "author": "privacy_advocate",
        "content": "Self-hosting is the way to go! I've got Jellyfin, Bitwarden, and Gitea running on a Raspberry Pi 4. Amazing what you can do with such little hardware."
      },
      {
        "author": "docker_fan",
        "content": "Docker makes self-hosting so much easier. Just compose up and you're running. My stack: Traefik reverse proxy, PostgreSQL, Redis, and about 20 different services."
      },
      {
        "author": "network_newbie",
        "content": "How do you handle dynamic IPs and port forwarding? My ISP doesn't give static IPs and I'm worried about security."
      },
      {
        "author": "homelab_hero!server123",
        "content": "@network_newbie Use a dynamic DNS service like DuckDNS. For security, VPN is your friend - WireGuard is simple to set up."
      }
    ]
  },
  {
    "board": "watercooler",
    "title": "What's everyone cooking this weekend?",
    "posts": [
      {
        "author": "chef_wannabe",
        "content": "Planning to try making ramen from scratch. Found this 3-day recipe for tonkotsu broth that looks intense but delicious."
      },
      {
        "author": "lazy_cook",
        "content": "Meanwhile I'm over here proud that I didn't order takeout and actually used my instant pot for chili. Baby steps! 😅"
      },
      {
        "author": "bbq_master!grill987",
        "content": "Smoking a brisket tomorrow. 14-hour cook starting at 4 AM. The neighbors think I'm crazy but they'll change their tune when they smell it."
      },
      {
        "author": "vegetarian_vie",
        "content": "Making a massive pot of dal and some fresh naan. Nothing beats homemade Indian food when it's cold outside."
      },
      {
        "author": "baker_betty",
        "content": "Sourdough Saturday! My starter is finally stable after months of trial and error. Making two loaves and some focaccia."
      }
    ]
  },
  {
    "board": "watercooler",
    "title": "Movies that blew your mind recently",
    "posts": [
      {
        "author": "film_buff!cinema123",
        "content": "Just watched Everything Everywhere All at Once for the third time. Still finding new details. The editing and creativity is just insane."
      },
      {
        "author": "sci_fi_fan",
        "content": "Dune Part Two was incredible in IMAX. Villeneuve really knows how to make sci-fi feel epic and grounded at the same time."
      },
      {
        "author": "indie_lover",
        "content": "Check out The Banshees of Inisherin if you haven't. Dark comedy that gets under your skin. Colin Farrell is fantastic."
      },
      {
        "author": "horror_head",
        "content": "Barbarian caught me completely off guard. Went in blind and had my jaw on the floor multiple times. No spoilers but... wow."
      },
      {
        "author": "film_buff!cinema123",
        "content": "All great picks! I need to add Barbarian to my list. Been meaning to catch up on more horror films."
      }
    ]
  },
  {
    "board": "watercooler",
    "title": "Gaming backlog support group",
    "posts": [
      {
        "author": "patient_gamer",
        "content": "My Steam library has 347 games and I've played maybe 50 of them. Anyone else have this problem? Keep buying games on sale..."
      },
      {
        "author": "indie_explorer",
        "content": "Same boat! Just picked up 8 games in the winter sale. Still haven't finished Baldur's Gate 3 from 6 months ago."
      },
      {
        "author": "retro_revival",
        "content": "I've gone the opposite direction - only playing old classics I missed. Currently working through Final Fantasy VI. These 90s JRPGs hit different."
      },
      {
        "author": "completionist",
        "content": "I forced myself to finish 3 games before buying any new ones. Currently playing Hollow Knight - this game is hard but so good!"
      },
      {
        "author": "multiplayer_addict",
        "content": "My backlog is all single-player games because I can't stop playing Rocket League and Valorant with friends. Send help."
      }
    ]
  },
  {
    "board": "general",
    "title": "Linux distro recommendations 2024",
    "posts": [
      {
        "author": "penguin_power!linux123",
        "content": "Looking to switch from Windows. What's the current state of Linux for desktop use? I do software development and some light gaming."
      },
      {
        "author": "ubuntu_user",
        "content": "Ubuntu LTS is still the safest bet for beginners. Great hardware support, huge community, and it just works. Plus WSL compatibility if you need Windows stuff."
      },
      {
        "author": "arch_evangelist",
        "content": "Arch Linux if you want to learn and customize everything. AUR is amazing. Fair warning: you'll spend more time tweaking your system than using it at first."
      },
      {
        "author": "fedora_fan",
        "content": "Fedora strikes a good balance - cutting edge packages but stable. Great for developers. GNOME is polished and the DNF package manager is solid."
      },
      {
        "author": "mint_enthusiast",
        "content": "Linux Mint for the most Windows-like experience. Cinnamon desktop feels familiar and everything just works out of the box."
      },
      {
        "author": "penguin_power!linux123",
        "content": "Thanks for all the suggestions! Think I'll start with Ubuntu and maybe distro-hop later once I'm more comfortable."
      }
    ]
  },
  {
    "board": "general",
    "title": "Remote work tips and tricks",
    "posts": [
      {
        "author": "remote_veteran!wfh456",
        "content": "Been working remotely for 5 years now. Happy to share some tips that have helped me stay productive and sane."
      },
      {
        "author": "new_remote_worker",
        "content": "Please do! Just started remote work and struggling with work-life balance. Feel like I'm always \"at work\" now."
      },
      {
        "author": "remote_veteran!wfh456",
        "content": "1. Dedicated workspace - even just a corner of a room. 2. Actual work hours - stick to them. 3. Get dressed like you're going to office. 4. Take real lunch breaks away from computer."
      },
      {
        "author": "zoom_fatigue_sufferer",
        "content": "Anyone else exhausted by video calls? I have back-to-back meetings some days and feel drained."
      },
      {
        "author": "meeting_optimizer",
        "content": "@zoom_fatigue_sufferer Try audio-only calls when possible. Also push for shorter meetings - most 1-hour meetings could be 30 minutes."
      },
      {
        "author": "social_butterfly",
        "content": "The isolation is real. I miss casual office conversations. Started working from coffee shops once a week to feel human again."
      }
    ]
  },
  {
    "board": "watercooler",
    "title": "Best coffee setup for home office?",
    "posts": [
      {
        "author": "coffee_addict!brew123",
        "content": "What's everyone using for coffee in their home office? Currently just have a basic drip machine but thinking of upgrading."
      },
      {
        "author": "espresso_expert",
        "content": "If you're serious about coffee, get a decent espresso machine. Breville Barista Express is a good entry point. Game changer for morning productivity."
      },
      {
        "author": "pour_over_purist",
        "content": "V60 pour over setup is all you need. Cheaper than espresso, better than drip. Takes 5 minutes and you can dial in the perfect cup."
      },
      {
        "author": "french_press_fan",
        "content": "French press is the way to go for simplicity. Coarse grind, 4 minutes, done. Makes enough for multiple cups too."
      },
      {
        "author": "cold_brew_crew",
        "content": "Cold brew concentrate in the fridge. Make a big batch on Sunday, just add hot water during the week. Smooth and convenient."
      },
      {
        "author": "coffee_addict!brew123",
        "content": "Lots of good options! Think I'll start with a French press and work my way up. Thanks everyone!"
      }
    ]
  },
  {
    "board": "general",
    "title": "Side project motivation",
    "posts": [
      {
        "author": "serial_starter",
        "content": "Anyone else struggle with finishing side projects? I have like 15 half-built apps and websites sitting in GitHub. How do you stay motivated?"
      },
      {
        "author": "project_finisher",
        "content": "Start smaller! Instead of building the next Facebook, make a simple todo app or calculator. Finishing something small feels better than abandoning something big."
      },
      {
        "author": "deadline_driven",
        "content": "Give yourself artificial deadlines. I tell friends/family about my projects and when I'll demo them. Social pressure works wonders."
      },
      {
        "author": "mvp_mindset",
        "content": "Focus on MVP - Minimum Viable Product. Get something working and deployed, even if it's ugly. You can always improve it later."
      },
      {
        "author": "motivation_seeker",
        "content": "I struggle with this too. The excitement of starting something new always beats the grind of finishing. Maybe we need accountability partners?"
      },
      {
        "author": "serial_starter",
        "content": "Great advice everyone. Maybe I should pick one project and actually see it through instead of starting something new every week..."
      }
    ]
  }
]